R이란?
  데이터 분석 소프트웨어이다. 기업 학계 언론등 다양한 분야에서 분석가들이 R을 실무에서 사용하고있다.
데이터 분석 도구들(SPSS, SAS..)사이에서 큰 인기를 끌고있고 점유율도 계속 높아지고 있다.

R을 어디에?
  많은 사람들이 R을 애용하는 가장 큰 이유는 다양성이다. R은 범용 분석툴이기 때문에 하나만 잘 다루면 어떤 형태의 데이터든지 자유롭게 분석 할 수 있다.

>통계 분석 - 기초 통계분석부터 가설검정에 사용되는 고급 통계분석 기법에까지 다양한 통계 분석 기법들을 활용할 수 있다.

>머신 러닝 - 다량의 데이터를 이용해서 예측할 수 있는 모델을 만드는 기법이다. 랜덤 포레스트, SVM , 딥러닝등 최선 머신러닝 알고리즘을 쉽게 활용. (머신러닝적합성은 파이썬이 조금더)

>텍스트 마이닝 - 문자로 이뤄진 데이터를 분석, 자주 등장하는 단어를 찾거나 감정을 나타낸 단어가 자주 사용되는 패턴을 분석.(댓글에 감정등을 판단하여 분석)

>소셜네트워크 - 트위터 페이스북과같은 SNS에서 사람들이 어떤 관계를 형성하고 있는지 어떤 경로로 메시지가 퍼져나가는지등을 분석

>지도 시각화 - 위도 경도 등의 지리 정보 지역통계를 활용하여 특성들을 지도로 쉽게 표현 할 수 있다. 

>주식분석(비트코인) - 온라인에서 관련 데이터를 수집해서 분석하여 투자에 사용되는 지표들을 계산하거나 그래프로 표현한다.

>이미지 분석 - 사진 그림등의 이미지에서 속성을 추출해서 데이터로 변환하여 식별등 영상 알고리즘개발에 사용할 수 있다.

>사운드 분석 - 소리 데이터에서 음량 진폭등의 속성을 추출해서 데이터로 변환하여 시각화 할 수 있다. 추출한 데이터는 음식인식이나 음악찾기등의 알고리즘 개발에 사용된다.


R과 파이썬
서로 다른 목적에 따라 개발된 두 도구는 다른 특징을 가지고 있다. 먼저 R은 데이터 분석 전용으로 만들어진 언어이기에 데이터 처리와 통계 분석에 특화되어있다. 특히 프로그래밍 지식이 많지 않아도 쉽고 간단한 문법으로 데이터를 분석할 수 있는 장점이 있다.

반면에 파이썬은 소프트웨어를 개발하는 프로그래밍 언어이다.


R studio는 R의 개발환경 IDE이다.
소스창 코드입력, 명령어 입력
콘솔창 코드실행 ctrl enter
환경창 생성한 데이터 볼수있음.
파일창 워킹디렉터리의 내용을 보여준다. 파일 탐색기와 유사


1+1
2+2

a=1
a

a <- 2
a